package ru.vsu.edu.shlyikov_d_g.humans.enums;

import java.util.Arrays;
import java.util.Collections;
import java.util.List;
import java.util.Random;

public enum FemaleNames {
    Августа,Авдотья,Аврора,Агата,Агапия,Агафья,Аглая,Агнесса,Агния,Агриппина,Агунда,Ада,Аделина,Аделаида,Адель,Адиля,
    Адриана,Аза,Азалия,Азиза,Айгуль,Айлин,Айнагуль,Аида,Айжан,Аксинья,Акулина,Алана,Алевтина,Александра,Алена,Алико,
    Алина,Алиса,Алия,Алла,Алсу,Альба,Альберта,Альбина,Альвина,Альфия,Альфреда,Аля,Амаль,Амелия,Амина,Амира,Анаит,
    Анастасия,Ангелина,Анеля,Анжела,Анжелика,Анисья,Анита,Анна,Антонина,Анфиса,Аполлинария,Арабелла,Ариадна,Ариана,
    Арина,Архелия,Асель,Асия,Ассоль,Астра,Астрид,Ася,Аурелия,Афанасия,Аэлита,Беатриса,Белинда,Белла,Берта,Бирута,
    Богдана,Божена,Борислава,Бронислава,Валентина,Валерия,Ванда,Ванесса,Варвара,Василина,Василиса,Венера,Вера,Вероника,
    Веселина,Весна,Веста,Вета,Вида,Викторина,Виктория,Вилена,Вилора,Виолетта,Виргиния,Виринея,Вита,Виталина,Влада,
    Владислава,Владлена,Габриэлла,Галина,Галия,Гаянэ,Гелена,Гелла,Генриетта,Георгина,Гера,Гертруда,
    Глафира,Глаша,Глория,Гражина,Грета,Гузель,Гулия,Гульмира,Гульназ,Гульнара,Гульшат,Дайна,Далия,Дамира,Дана,
    Даниэла,Данута,Дара,Дарина,Дарья,Даяна,Дебора,Джамиля,Джемма,Дженнифер,Джессика,Джулия,Джульетта,Диана,Дилара,
    Дильназ,Дильнара,Диля,Дина,Динара,Диодора,Дионисия,Долорес,Доля,Доминика,Дора,Ева,Евангелина,Евгения,Евдокия,
    Екатерина,Елена,Елизавета,Есения,Ефимия,Жанна,Жасмин,Жозефина,Забава,Заира,Замира,Зара,Зарема,Зарина,Захария,
    Земфира,Зинаида,Зита,Злата,Зоряна,Зоя,Зульфия,Зухра,Иванна,Иветта,Ивона,Ида,Изабелла,Изольда,Илария,Илиана,
    Илона,Инара,Инга,Ингеборга,Индира,Инесса,Инна,Иоанна,Иоланта,Ираида,Ирина,Ирма,Искра,Ия,Калерия,Камилла,
    Капитолина,Карима,Карина,Каролина,Катарина,Кира,Клавдия,Клара,Кларисса,Климентина,Констанция,Кора,Корнелия,
    Кристина,Ксения,Лада,Лайма,Лана,Лара,Лариса,Лаура,Лейла,Лейсан,Леокадия,Леонида,Лера,Леся,Лиана,Лидия,Лиза,
    Лика,Лилиана,Лилия,Лина,Линда,Лиора,Лира,Лия,Лола,Лолита,Лора,Луиза,Лукерья,Любовь,Людмила,Ляля,Люция,Магда,
    Магдалина,Мадина,Майя,Малика,Мальвина,Мара,Маргарита,Марианна,Марика,Марина,Мария,Марселина,Марта,Маруся,Марфа,
    Марьям,Матильда,Мелания,Мелисса,Мика,Мила,Милада,Милана,Милена,Милица,Милолика,Милослава,Мира,Мирослава,Мирра,
    Моника,Муза,Мэри,Надежда,Назира,Наиля,Наима,Нана,Наоми,Наталья,Нателла,Нелли,Неонила,Ника,Николь,Нина,Нинель,
    Нонна,Нора,Нурия,Одетта,Оксана,Октябрина,Олеся,Оливия,Ольга,Офелия,Павла,Павлина,Памела,Патриция,Пелагея,Перизат,
    Полина,Прасковья,Рада,Радмила,Раиса,Ревекка,Регина,Рема,Рената,Римма,Рина,Рита,Рогнеда,Роберта,Роза,Роксана,
    Ростислава,Рузалия,Рузанна,Рузиля,Румия,Русалина,Руслана,Руфина,Сабина,Сабрина,Сажида,Саида,Саломея,Самира,
    Сандра,Сания,Санта,Сара,Сати,Светлана,Святослава,Севара,Северина,Селена,Серафима,Сильва,Сима,Симона,Слава,Снежана,
    Соня,София,Станислава,Стелла,Стефания,Сусанна,Таира,Таисия,Тала,Тамара,Тамила,Тара,Татьяна,Тереза,Тина,Тора,Ульяна,
    Урсула,Устина,Устинья,Фаиза,Фаина,Фания,Фаня,Фарида,Фатима,Фая,Фекла,Фелиция,Феруза,Физура,Флора,Франсуаза,Фрида,
    Харита,Хилари,Хильда,Хлоя,Христина,Цветана,Челси,Чеслава,Чулпан,Шакира,Шарлотта,Шейла,Шелли,Шерил,Эвелина,Эвита,
    Эдда,Эдита,Элеонора,Элиана,Элиза,Элина,Элла,Эллада,Элоиза,Эльвина,Эльвира,Эльга,Эльза,Эльмира,Эльнара,Эля,Эмилия,
    Эмма,Эмили,Эрика,Эрнестина,Эсмеральда,Этель,Этери,Юзефа,Юлия,Юна,Юния,Юнона,Ядвига,Яна,Янина,Ярина,Ярослава,Ясмина;

    private static final List<FemaleNames> VALUES =
            Collections.unmodifiableList(Arrays.asList(values()));
    private static final int SIZE = VALUES.size();
    private static final Random RANDOM = new Random();

    public static FemaleNames randomFemaleName()  {
        return VALUES.get(RANDOM.nextInt(SIZE));
    }
}
